<?php
    $ceu = array(
        "Італія" => "Рим",
        "Люксембург" => "Люксембург",
        "Бельгія" => "Брюссель",
        "Данія" => "Копенгаген",
        "Фінляндія" => "Гельсінкі",
        "Франція" => "Париж",
        "Словаччина" => "Братислава",
        "Словенія" => "Любляна",
        "Німеччина" => "Берлін",
        "Греція" => "Афіни",
        "Ірландія" => "Дублін",
        "Нідерланди" => "Амстердам",
        "Португалія" => "Лісабон",
        "Іспанія" => "Мадрид",
        "Швеція" => "Стокгольм",
        "Велика Британія" => "Лондон",
        "Кіпр" => "Нікосія",
        "Литва" => "Вільнюс",
        "Чехія" => "Прага",
        "Естонія" => "Таллінн",
        "Угорщина" => "Будапешт",
        "Латвія" => "Рига",
        "Мальта" => "Валлетта",
        "Австрія" => "Відень",
        "Польща" => "Варшава",
        "Україна" => "Київ"
    );

    function getGenitiveCase($country) {
        $genitiveForms = [
            "Італія" => "Італії",
            "Люксембург" => "Люксембургу",
            "Бельгія" => "Бельгії",
            "Данія" => "Данії",
            "Фінляндія" => "Фінляндії",
            "Франція" => "Франції",
            "Словаччина" => "Словаччини",
            "Словенія" => "Словенії",
            "Німеччина" => "Німеччини",
            "Греція" => "Греції",
            "Ірландія" => "Ірландії",
            "Нідерланди" => "Нідерландів",
            "Португалія" => "Португалії",
            "Іспанія" => "Іспанії",
            "Швеція" => "Швеції",
            "Велика Британія" => "Великої Британії",
            "Кіпр" => "Кіпру",
            "Литва" => "Литви",
            "Чехія" => "Чехії",
            "Естонія" => "Естонії",
            "Угорщина" => "Угорщини",
            "Латвія" => "Латвії",
            "Мальта" => "Мальти",
            "Австрія" => "Австрії",
            "Польща" => "Польщі",
            "Україна" => "України"
        ];
    
        return $genitiveForms[$country];
    }

    function displayCapitals($ceu) {
        asort($ceu);

        foreach ($ceu as $country => $capital) {
            echo "$capital це столиця " . getGenitiveCase($country) . "<br>";
        }

    }
?>